export const versionInfo = [
  {
    versionNum: "V1.6.1.20240430Alpha.1.0",
    date: "2024/4/30",
    content: [
      "修复数据集标注双击切换未标注已标注内容时重复添加问题",
      "修复数据集标注delete删除当前标注异常问题",
      "增加lineTool划线工具快捷键",
      "优化数据集标注brush工具使用体验",
      "修复删除全部标注时误删除已标注文件标注内容问题"
    ],
  },
  {
    versionNum: "V1.6.1.20240428Alpha.1.0",
    date: "2024/4/28",
    content: [
      "修复删除数据集标注后可视区域外缩略图未更新问题",
      "修复特定场景下选择自动标注算法导致当前标注图片切换问题",
      "更好的数据标注流程交互",
    ],
  },
  {
    versionNum: "V1.6.1.20240426Alpha.1.0",
    date: "2024/4/26",
    content: [
      "优化算子流程输出界面",
      "数据集标注增加智能标注功能",
      "修复算子流程调试功能不可用、节点ID重复问题",
      "优化brush标注工具交互体验",
    ],
  },
  {
    versionNum: "V1.6.1.20240424Alpha.1.0.prod",
    date: "2024/4/24",
    content:  "定时任务系统跨域漏洞修复"
  },{
    versionNum: "V1.6.1.20240419Alpha.1.0.prod",
    date: "2024/4/19",
    content: "souremap  漏洞修复"
  },
  {
    versionNum: "V1.6.1.20240410Alpha.1.1",
    date: "2024/4/10",
    content: [
      "标注工具图片添加本地缓存，解决加载卡顿问题",
      "RPA标注增加算子锁，增加算子与图片关联",
      "优化算子流程页面内存性能，解决内存泄漏问题",
      "算子组编辑增加多点继承，增加节点id",
      "修复模型训练无法勾选数据集问题，添加自动标注模型用户配置",
      "算子流程增加选择系统内模型功能",
    ],
  },
  {
    versionNum: "V1.6.1.20240409Alpha.1.0.prod",
    date: "2024/4/9",
    content: "中间件redis、nacos增加认证",
  },
  {
    versionNum: "V1.6.1.20240206Alpha.1.0",
    date: "2024/2/6",
    content: "修改token刷新bug",
  },
  {
    versionNum: "V1.6.1.20240202Alpha.1.0",
    date: "2024/2/2",
    content: "优化数据集上传解析速度",
  },
  {
    versionNum: "V1.6.1.20240125Alpha.1.0",
    date: "2024/1/25",
    content:
      "反馈问题修改：添加数据集上传最小化功能、普通用户禁止删除admin用户数据集图片等问题",
  },
  {
    versionNum: "V1.6.1.20240117Alpha.1.0",
    date: "2024/1/17",
    content: "反馈问题修改：上传数据过程跳转到登录页，数据集分类信息错误等问题",
  },
  {
    versionNum: "V1.6.1.20240105Alpha.1.0",
    date: "2024/1/5",
    content: "增加探针功能",
  },
  {
    versionNum: "V1.6.1.20231228Alpha.1.0",
    date: "2023/12/28",
    content:
      "接续训练功能：模型训练暂停后，可以继续最后一个epoch接续训练，也可以对中间模型评估测试",
  },
  {
    versionNum: "V1.6.1.20231222Alpha.1.0",
    date: "2023/12/22",
    content: [
      "优化了标注工具的大数据量的图片加载，以及提示标注和自动标注渲染结果的生成",
      "使用大模型提示标注、使用已训练模型自动标注",
      "优化了数据集图片列表展示及显示标注的加载时间",
      "提供了全新的标注工具的UI展示以及新的交互体验",
      "加入文件管理的业务，主要包括：个人数据的增删查，复制移动，设置共享；共享数据的查询，下载；公共数据的查询，下载",
      "个人文件管理和数据集数据存储不依赖子目录类别",
    ],
  },
  {
    versionNum: "V1.6.1.20231110Alpha",
    date: "2023/11/10",
    content: [
      "升级标注工具，提供多种易用标注组件和操作工具，改进易于用户的交互方式",
      "新增了待标注图片预览，图片标注确认功能",
      "新增提示标注：基于分割通用大模型，在原图通过笔触标记前景prompt，快速标注数据集内相似样本",
      "新增自动标注：使用平台内业务训练好的模型快速标注业务相关数据集",
      "新增数据集标签管理，以及类别标注操作",
      "新增类别标注的数据统计",
      "新增对已标注图片的确认以及特定阈值图片的确认",
      "标注的结果数据可在模型训练中更好的使用。",
    ],
  },
  {
    versionNum: "V1.6.1.20231016Alpha",
    date: "2023/10/16",
    content: [
      "修复训练中心--离线评估--列表的任务类型为空",
      "修复训练中心--模型管理--通用模型--新建训练--第1步上面算法有时无法选择",
      "修复训练中心--模型管理--通用模型 --新建训练 内置的分类算法_分类类型的训练任务启动训练失败报错！  训练不了",
      "修复训练中心--离线评估--查看报告--转换为数据集---确认后提示信息不正确",
      "修复训练中心--模型管理--列表 --更多，查看时日志时有慢要给一个优化展示方式",
      "修复训练中心--模型管理--列表---查看异常终止Pod exist 异常时去查看日志。提示文件 不存优化表现形式",
      "修复数据中心-数据集管理-数据集详情 ---分辨率不协调",
    ],
  },
];
